{"title":"【Project】VR CRISPR GAME","date":"2019-10-27T02:37:46.000Z","author":"Ziduan Zhang","thumbnail":"img/post6.png","slug":"【Project】VR CRISPR GAME","tags":["Hackathon","VR","作品","游戏","项目"],"categories":["作品"],"updated":"2019-10-28T07:36:50.435Z","content":"<p>This is a Hackathon project made in 24 hours. It’s a VR game talking about CRISPR-cas9 technology.</p>\n<a id=\"more\"></a>\n<blockquote>\n<p>We have a website to introduce our project when we take part in the hackathon. Here is the link: <a href=\"https://www.hackx.org/projects/410\" target=\"_blank\" rel=\"noopener\">Click here</a><br>Most of the content on this website is coming from the link above.</p>\n</blockquote>\n<h2 id=\"SHORT-DESCRIPTION\">SHORT DESCRIPTION<a href=\"post/【Project】VR CRISPR GAME#SHORT-DESCRIPTION\"></a></h2><p>The game allows the user to have simulative hands-on experience of CRISPR technology through leap motion and VR.</p>\n<h2 id=\"DESCRIPTION\">DESCRIPTION<a href=\"post/【Project】VR CRISPR GAME#DESCRIPTION\"></a></h2><p><strong>The game allows the user to have simulative hands-on experience of CRISPR technology through leap motion and VR.</strong></p>\n<p><img src=\"/img/post6/2.jpg\" alt=\"hardware\"><br>↑ The VR headset and the Leap Motion</p>\n<p>Our team aims to create a game that briefly introduces the overall process of gene-editing technology, CRISPR-cas9. The operation of this game is based on Leap Motion, a highly accurate sensor that catches the user’s hand motions and shows them on the VR screen. In this way, the user can have a direct and interactive experience of conducting a molecular-level experiment. There are three main steps to the experiment – designing the guide RNA sequence, inserting the Cas9 complex, and testing the resulting DNA product. Instructions and hints of the working principle could be found in each step. We have also included the concept of off-target effect by allowing the Cas9 functional unit to cut multiple sites, which contain both intended and similar ones. Through playing this game, the user would have a general understanding of the entire CRISPR technology and how it works.</p>\n<h2 id=\"Playtest-video\">Playtest video<a href=\"post/【Project】VR CRISPR GAME#Playtest-video\"></a></h2><video id=\"play test\" controls preload=\"none\" width=\"100%\" height=\"100%\"><br>    <source id=\"mp4\" src=\"/video/6-1.mp4\" type=\"video/mp4\"><br></video>\n\n<h2 id=\"IDEAS-DESCRIPTION\">IDEAS DESCRIPTION<a href=\"post/【Project】VR CRISPR GAME#IDEAS-DESCRIPTION\"></a></h2><p>Our team’s initial thought was that interactively playing a game using Leap Motion would be pretty cool, so we started brainstorming what games we could design based on this platform. Inspired by the late CRISPR technology introduced in the bioinformatics course, we decided to visualize this complex process and make it more comprehensible to the general public. We consider this game meaningful for biology education because it provides a direct way of viewing the molecular world and controlling the molecules by hand. Different from simply receiving the knowledge in tutorial videos, this game lets the users make the choice of which nucleotides to use and where to place them, simulating the realtime situation.</p>\n<h2 id=\"SOLVED-PROBLEMS\">SOLVED PROBLEMS<a href=\"post/【Project】VR CRISPR GAME#SOLVED-PROBLEMS\"></a></h2><p>Creating a DNA model; provides a new way for people to learn CRISPR/cas9.</p>\n<h2 id=\"FEATURES-DESCRIPTION\">FEATURES DESCRIPTION<a href=\"post/【Project】VR CRISPR GAME#FEATURES-DESCRIPTION\"></a></h2><p>The game offers hands-on experience of CRISPR technology by seizing the user’s hand motions. The 3D model shown by VR allows the user to understand the entire process through a realtime simulation, enabling a clearer and more stereoscopic view of the molecules.</p>\n<h2 id=\"UI-DESCRIPTION\">UI DESCRIPTION<a href=\"post/【Project】VR CRISPR GAME#UI-DESCRIPTION\"></a></h2><p>The UI is designed through an intuitive view – a screen that contains the description of each step’s mission as well as a toolbox on the right-hand side and a hint button shown when the user flips a hand. The main screen basically tells the user what and how to do, and the toolbox is where the ingredients or functional units are given. The hint button provides explanations of every relevant theory.</p>\n<h2 id=\"CORE-TECH-DESCRIPTION\">CORE TECH DESCRIPTION<a href=\"post/【Project】VR CRISPR GAME#CORE-TECH-DESCRIPTION\"></a></h2><p>Our team’s core tech includes Leap Motion, the VR device, and Unity. Leap Motion mainly captures the user’s hand motions and projects the actions onto the VR screen. The VR device allows the user to view the 3D structure of the molecules. Unity is where the game is designed and created. Through Unity, we have achieved 3D modeling, designing the scene and background, and human-computer interaction, which is relating the actions to the motion of the molecules.</p>\n<h2 id=\"FUTURE-PLAN\">FUTURE PLAN<a href=\"post/【Project】VR CRISPR GAME#FUTURE-PLAN\"></a></h2><p>The game could be turned into an interactive guide RNA design tool in the future. Now there are only limited DNA model chains and therefore limited possibilities for CRISPR experiment. By incorporating a database of DNA and editable sequences into the game, researchers could actually design their guide RNA through the interactive motions captured by Leap Motion and viewed in 3D with the VR device.</p>\n<h2 id=\"My-team\">My team<a href=\"post/【Project】VR CRISPR GAME#My-team\"></a></h2><div class=\"article-img\"><p><img src=\"/img/post6/1.jpg\" alt=\"my team\" data-zoomable></p></div>\n<p>This is my Hackathon team. Looking from left to right, the first one is me. As the team leader, responsible for almost everything, but mainly programming. The second one is the only girl in the team who is responsible for biology-related theory. The third and fourth people are mainly responsible for the arts and making 3D models. The last one is also responsible for programming.</p>\n<h2 id=\"Source-code\">Source code<a href=\"post/【Project】VR CRISPR GAME#Source-code\"></a></h2><p>The code is on the GitHub.<br>Click <a href=\"https://github.com/Sokias/VR-CRISPR-GAME\" target=\"_blank\" rel=\"noopener\">Here</a> to redirect to the GitHub</p>\n","next":{"title":"【Project】AR Flying Chess","slug":"【Project】AR Flying Chess"},"link":"http://ziduan.tech/post/【Project】VR CRISPR GAME/","toc":[{"title":"SHORT DESCRIPTION","id":"SHORT-DESCRIPTION","index":"1"},{"title":"DESCRIPTION","id":"DESCRIPTION","index":"2"},{"title":"Playtest video","id":"Playtest-video","index":"3"},{"title":"IDEAS DESCRIPTION","id":"IDEAS-DESCRIPTION","index":"4"},{"title":"SOLVED PROBLEMS","id":"SOLVED-PROBLEMS","index":"5"},{"title":"FEATURES DESCRIPTION","id":"FEATURES-DESCRIPTION","index":"6"},{"title":"UI DESCRIPTION","id":"UI-DESCRIPTION","index":"7"},{"title":"CORE TECH DESCRIPTION","id":"CORE-TECH-DESCRIPTION","index":"8"},{"title":"FUTURE PLAN","id":"FUTURE-PLAN","index":"9"},{"title":"My team","id":"My-team","index":"10"},{"title":"Source code","id":"Source-code","index":"11"}],"reward":true,"copyright":{"license":"自由转载-保持署名-非商用-禁止演绎 (<a href=\\\"https://creativecommons.org/licenses/by-nc-sa/4.0/\\\" rel=\\\"external nofollow noopener\\\" target=\\\"_blank\\\">CC BY-NC-ND 4.0</a>)","author":"Ziduan Zhang","link":"<a href=\"http://ziduan.tech/post/【Project】VR CRISPR GAME/\" title=\"【Project】VR CRISPR GAME\">http://ziduan.tech/post/【Project】VR CRISPR GAME/</a>"}}